#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/stackhpc/github/runs/run-9GR6TWYEXgL6tguc

Waiting for the plan to start...

Terraform v1.2.4
on linux_amd64
Initializing plugins and modules...
data.github_repository.repositories[".github"]: Reading...
github_team.organisation_teams["SMSLab"]: Refreshing state... [id=6372896]
data.github_repository.repositories["ansible-role-rundeck"]: Reading...
github_team.organisation_teams["Azimuth"]: Refreshing state... [id=6372898]
github_team.organisation_teams["Batch"]: Refreshing state... [id=6372897]
github_team.organisation_teams["Developers"]: Refreshing state... [id=6309608]
github_team.organisation_teams["ReleaseTrain"]: Refreshing state... [id=6372895]
github_repository.repositories[".github"]: Refreshing state... [id=.github]
github_team.organisation_teams["OpenStack"]: Refreshing state... [id=6372899]
github_team.organisation_teams["Ansible"]: Refreshing state... [id=2454000]
github_team.organisation_teams["Kayobe"]: Refreshing state... [id=6156230]
github_issue_label.community_files_label[".github"]: Refreshing state... [id=.github:community-files]
github_issue_label.workflows_label[".github"]: Refreshing state... [id=.github:workflows]
github_issue_label.stackhpc_ci_label[".github"]: Refreshing state... [id=.github:stackhpc-ci]
data.github_repository.repositories["ansible-role-rundeck"]: Read complete after 1s [id=ansible-role-rundeck]
data.github_repository.repositories[".github"]: Read complete after 1s [id=.github]
github_team_repository.release_train_repositories[".github"]: Refreshing state... [id=6372895:.github]
github_branch_protection.release_train_branch_protection[".github"]: Refreshing state... [id=BPR_kwDOHK-Qcs4BodCX]
github_team_membership.team_membership["Developers:jcoquillon"]: Refreshing state... [id=6309608:jcoquillon]
github_team_membership.team_membership["Developers:JohnGarbutt"]: Refreshing state... [id=6309608:JohnGarbutt]
github_team_membership.team_membership["Developers:jackhodgkiss"]: Refreshing state... [id=6309608:jackhodgkiss]
github_team_membership.team_membership["Developers:g0rgamesh"]: Refreshing state... [id=6309608:g0rgamesh]
github_team_repository.developers_repositories[".github"]: Refreshing state... [id=6309608:.github]
github_team_membership.team_membership["Developers:markgoddard"]: Refreshing state... [id=6309608:markgoddard]
github_team_membership.team_membership["Developers:sjpb"]: Refreshing state... [id=6309608:sjpb]
github_team_membership.team_membership["Kayobe:dougszumski"]: Refreshing state... [id=6156230:dougszumski]
github_team_membership.team_membership["Kayobe:jovial"]: Refreshing state... [id=6156230:jovial]
github_team_membership.team_membership["Developers:johntaylorsc"]: Refreshing state... [id=6309608:johntaylorsc]
github_team_membership.team_membership["Ansible:cityofships"]: Refreshing state... [id=2454000:cityofships]
github_team_membership.team_membership["Developers:jovial"]: Refreshing state... [id=6309608:jovial]
github_team_membership.team_membership["Developers:mkjpryor"]: Refreshing state... [id=6309608:mkjpryor]
github_team_membership.team_membership["Kayobe:bbezak"]: Refreshing state... [id=6156230:bbezak]
github_team_membership.team_membership["Developers:bbezak"]: Refreshing state... [id=6309608:bbezak]
github_team_membership.team_membership["Developers:mnasiadka"]: Refreshing state... [id=6309608:mnasiadka]
github_team_membership.team_membership["Ansible:GregWhiteyBialas"]: Refreshing state... [id=2454000:GregWhiteyBialas]
github_team_membership.team_membership["Ansible:k-s-dean"]: Refreshing state... [id=2454000:k-s-dean]
github_team_membership.team_membership["Ansible:oneswig"]: Refreshing state... [id=2454000:oneswig]
github_team_membership.team_membership["Developers:cityofships"]: Refreshing state... [id=6309608:cityofships]
github_team_membership.team_membership["Developers:oneswig"]: Refreshing state... [id=6309608:oneswig]
github_team_membership.team_membership["Kayobe:mnasiadka"]: Refreshing state... [id=6156230:mnasiadka]
github_team_membership.team_membership["Developers:GregWhiteyBialas"]: Refreshing state... [id=6309608:GregWhiteyBialas]
github_team_membership.team_membership["Ansible:jackhodgkiss"]: Refreshing state... [id=2454000:jackhodgkiss]
github_team_membership.team_membership["Developers:grzegorzkoper"]: Refreshing state... [id=6309608:grzegorzkoper]
github_team_membership.team_membership["Developers:stackhpc-ci"]: Refreshing state... [id=6309608:stackhpc-ci]
github_team_membership.team_membership["SMSLab:stackhpc-ci"]: Refreshing state... [id=6372896:stackhpc-ci]
github_team_membership.team_membership["Developers:darmach"]: Refreshing state... [id=6309608:darmach]
github_team_membership.team_membership["Ansible:dougszumski"]: Refreshing state... [id=2454000:dougszumski]
github_team_membership.team_membership["ReleaseTrain:stackhpc-ci"]: Refreshing state... [id=6372895:stackhpc-ci]
github_team_membership.team_membership["Ansible:jovial"]: Refreshing state... [id=2454000:jovial]
github_team_membership.team_membership["Kayobe:priteau"]: Refreshing state... [id=6156230:priteau]
github_team_membership.team_membership["Ansible:JohnGarbutt"]: Refreshing state... [id=2454000:JohnGarbutt]
github_team_membership.team_membership["OpenStack:stackhpc-ci"]: Refreshing state... [id=6372899:stackhpc-ci]
github_team_membership.team_membership["Ansible:g0rgamesh"]: Refreshing state... [id=2454000:g0rgamesh]
github_team_membership.team_membership["Ansible:bbezak"]: Refreshing state... [id=2454000:bbezak]
github_team_membership.team_membership["Ansible:m-bull"]: Refreshing state... [id=2454000:m-bull]
github_team_membership.team_membership["Ansible:sjpb"]: Refreshing state... [id=2454000:sjpb]
github_team_membership.team_membership["Ansible:mnasiadka"]: Refreshing state... [id=2454000:mnasiadka]
github_team_membership.team_membership["Ansible:markgoddard"]: Refreshing state... [id=2454000:markgoddard]
github_team_membership.team_membership["Developers:dougszumski"]: Refreshing state... [id=6309608:dougszumski]
github_team_membership.team_membership["Azimuth:stackhpc-ci"]: Refreshing state... [id=6372898:stackhpc-ci]
github_team_membership.team_membership["Ansible:stackhpc-ci"]: Refreshing state... [id=2454000:stackhpc-ci]
github_team_membership.team_membership["Batch:stackhpc-ci"]: Refreshing state... [id=6372897:stackhpc-ci]
github_team_membership.team_membership["Ansible:grzegorzkoper"]: Refreshing state... [id=2454000:grzegorzkoper]
github_team_membership.team_membership["Kayobe:markgoddard"]: Refreshing state... [id=6156230:markgoddard]
github_team_membership.team_membership["Developers:k-s-dean"]: Refreshing state... [id=6309608:k-s-dean]
github_team_membership.team_membership["Developers:priteau"]: Refreshing state... [id=6309608:priteau]
github_team_membership.team_membership["Developers:m-bull"]: Refreshing state... [id=6309608:m-bull]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # github_branch_protection.ansible_branch_protection["ansible-role-rundeck"] will be created
  + resource "github_branch_protection" "ansible_branch_protection" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + enforce_admins                  = false
      + id                              = (known after apply)
      + pattern                         = "master"
      + push_restrictions               = [
          + "T_kwDOAVsmNM4AYEbo",
        ]
      + repository_id                   = "MDEwOlJlcG9zaXRvcnkyMjMyMjE5NDI="
      + require_conversation_resolution = true
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + require_code_owner_reviews      = true
          + required_approving_review_count = 1
        }
    }

  # github_issue_label.community_files_label["ansible-role-rundeck"] will be created
  + resource "github_issue_label" "community_files_label" {
      + color       = "3F84E5"
      + description = "Community files have been modified"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "community-files"
      + repository  = "ansible-role-rundeck"
      + url         = (known after apply)
    }

  # github_issue_label.stackhpc_ci_label["ansible-role-rundeck"] will be created
  + resource "github_issue_label" "stackhpc_ci_label" {
      + color       = "E6E2C0"
      + description = "Automated action performed by stackhpc-ci"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "stackhpc-ci"
      + repository  = "ansible-role-rundeck"
      + url         = (known after apply)
    }

  # github_issue_label.workflows_label["ansible-role-rundeck"] will be created
  + resource "github_issue_label" "workflows_label" {
      + color       = "638475"
      + description = "Workflow files have been modified"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "workflows"
      + repository  = "ansible-role-rundeck"
      + url         = (known after apply)
    }

  # github_repository.repositories["ansible-role-rundeck"] will be created
  + resource "github_repository" "repositories" {
      + allow_auto_merge       = false
      + allow_merge_commit     = true
      + allow_rebase_merge     = true
      + allow_squash_merge     = true
      + archived               = false
      + branches               = (known after apply)
      + default_branch         = (known after apply)
      + delete_branch_on_merge = true
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + name                   = "ansible-role-rundeck"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + visibility             = (known after apply)
    }

  # github_team_repository.ansible_repositories["ansible-role-rundeck"] will be created
  + resource "github_team_repository" "ansible_repositories" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "ansible-role-rundeck"
      + team_id    = "2454000"
    }

  # github_team_repository.developers_repositories["ansible-role-rundeck"] will be created
  + resource "github_team_repository" "developers_repositories" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "ansible-role-rundeck"
      + team_id    = "6309608"
    }

Plan: 7 to add, 0 to change, 0 to destroy.


```

</details>

*Pusher: @jackhodgkiss, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform GitHub`*